# install package

In [2]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\emik\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\emik\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)

In [3]:
!pip install pymysql

Collecting pymysql
  Obtaining dependency information for pymysql from https://files.pythonhosted.org/packages/0c/94/e4181a1f6286f545507528c78016e00065ea913276888db2262507693ce5/PyMySQL-1.1.1-py3-none-any.whl.metadata
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   ---------------------------------------- 45.0/45.0 kB 1.1 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

sqlalchemy untuk nyambungin biar bisa baca mysql. pymysql buat biar python bisa baca dan ambil dari sql

# latihan cara koneksikan python dengan mysql

In [4]:
import pymysql
import pandas as pd

nb: terkadang ada perusahaan yang db-nya gak bisa diakses langsung dan gak bisa seenaknya diotak-atik. jadi bisa tetap ambil data dengan modal tau host, user, dan password

In [6]:
mydb_film = pymysql.connect(host="localhost", user="root", 
                       password="(tambahin password)",
                       database="film")

In [13]:
query1 = "SELECT * FROM film.subscriptions WHERE customer_id IN (1,2,3)"

data = mydb_film.cursor() #buat nyambungin
data.execute(query1) #jalankan query

result1 = data.fetchall() #ambil hasil execute query
kolom1 = [kolom1[0] for kolom1 in data.description] #ambil nama kolomnya

df1 = pd.DataFrame(result1, columns=kolom1) #ubah jadi df
df1

   customer_id  plan_id  start_date
0            1        0  2020-08-01
1            1        1  2020-08-08
2            2        0  2020-09-20
3            2        3  2020-09-27
4            3        0  2020-01-13
5            3        1  2020-01-20

# latihan dari database company

In [20]:
mydb_company = pymysql.connect(host="localhost", user="root", 
                       password="(tambahin password)*",
                       database="company")
data_company = mydb_company.cursor() #buat nyambungin

## bagian A

In [28]:
#nomor 1

query1_company = "SELECT SUM(salary) FROM company.employees"

data_company.execute(query1_company) #jalankan query

query1_company_result = data_company.fetchall() #ambil hasil execute query
query1_company_kolom = [query1_company_kolom[0] for query1_company_kolom in data_company.description] #ambil nama kolomnya

hasil1 = pd.DataFrame(query1_company_result, columns=query1_company_kolom) #ubah jadi df
hasil1

   SUM(salary)
0  37000000.00

In [29]:
#nomor 2

query2_company = "SELECT department, AVG(salary) FROM company.employees GROUP BY department"

data_company.execute(query2_company) #jalankan query

query2_company_result = data_company.fetchall() #ambil hasil execute query
query2_company_kolom = [query2_company_kolom[0] for query2_company_kolom in data_company.description] #ambil nama kolomnya

hasil2 = pd.DataFrame(query2_company_result, columns=query2_company_kolom) #ubah jadi df
hasil2

  department     AVG(salary)
0         IT  8250000.000000
1   Keuangan  7500000.000000
2        SDM  6000000.000000
3  Pemasaran  7000000.000000

In [30]:
#nomor 3

query3_company = "SELECT department, COUNT(employee_id) AS jumlah_karyawan FROM company.employees GROUP BY department"

data_company.execute(query3_company) #jalankan query

query3_company_result = data_company.fetchall() #ambil hasil execute query
query3_company_kolom = [query3_company_kolom[0] for query3_company_kolom in data_company.description] #ambil nama kolomnya

hasil3 = pd.DataFrame(query3_company_result, columns=query3_company_kolom) #ubah jadi df
hasil3

  department  jumlah_karyawan
0         IT                2
1   Keuangan                1
2        SDM                1
3  Pemasaran                1

In [31]:
#nomor 4

query4_company = "SELECT MAX(salary) AS gaji_tertinggi, MIN(salary)AS gaji_terendah FROM company.employees"

data_company.execute(query4_company) #jalankan query

query4_company_result = data_company.fetchall() #ambil hasil execute query
query4_company_kolom = [query4_company_kolom[0] for query4_company_kolom in data_company.description] #ambil nama kolomnya

hasil4 = pd.DataFrame(query4_company_result, columns=query4_company_kolom) #ubah jadi df
hasil4

  gaji_tertinggi gaji_terendah
0     8500000.00    6000000.00

## bagian B

In [32]:
#nomor 1b

query5_company = "SELECT DISTINCT department FROM company.employees"

data_company.execute(query5_company) #jalankan query

query5_company_result = data_company.fetchall() #ambil hasil execute query
query5_company_kolom = [query5_company_kolom[0] for query5_company_kolom in data_company.description] #ambil nama kolomnya

hasil5 = pd.DataFrame(query5_company_result, columns=query5_company_kolom) #ubah jadi df
hasil5

  department
0         IT
1   Keuangan
2        SDM
3  Pemasaran

In [34]:
#nomor 2b

query6_company = "SELECT first_name, COUNT(first_name), last_name, COUNT(last_name) FROM company.employees GROUP BY first_name, last_name"

data_company.execute(query6_company) #jalankan query

query6_company_result = data_company.fetchall() #ambil hasil execute query
query6_company_kolom = [query6_company_kolom[0] for query6_company_kolom in data_company.description] #ambil nama kolomnya

hasil6 = pd.DataFrame(query6_company_result, columns=query6_company_kolom) #ubah jadi df
hasil6

  first_name  COUNT(first_name)  last_name  COUNT(last_name)
0    Diondra                  1     Wiguna                 1
1       Budi                  1    Santoso                 1
2       Siti                  1  Rahmawati                 1
3       Andi                  1    Pratama                 1
4       Rini                  1     Kusuma                 1

## bagian C

In [35]:
#nomor 1c

query7_company = "SELECT department, SUM(salary) AS total_gaji FROM company.employees GROUP BY department"

data_company.execute(query7_company) #jalankan query

query7_company_result = data_company.fetchall() #ambil hasil execute query
query7_company_kolom = [query7_company_kolom[0] for query7_company_kolom in data_company.description] #ambil nama kolomnya

hasil7 = pd.DataFrame(query7_company_result, columns=query7_company_kolom) #ubah jadi df
hasil7

  department   total_gaji
0         IT  16500000.00
1   Keuangan   7500000.00
2        SDM   6000000.00
3  Pemasaran   7000000.00

In [ ]:
#nomor 2c

query8_company = "SELECT department, COUNT(employee_id) AS total_karyawan, SUM(salary) AS total_gaji FROM company.employees GROUP BY department"

data_company.execute(query8_company) #jalankan query

query8_company_result = data_company.fetchall() #ambil hasil execute query
query8_company_kolom = [query8_company_kolom[0] for query8_company_kolom in data_company.description] #ambil nama kolomnya

hasil8 = pd.DataFrame(query8_company_result, columns=query8_company_kolom) #ubah jadi df
hasil8

  department  total_karyawan   total_gaji
0         IT               2  16500000.00
1   Keuangan               1   7500000.00
2        SDM               1   6000000.00
3  Pemasaran               1   7000000.00

In [38]:
#nomor 3c

query9_company = "SELECT department, AVG(salary) AS ratarata_gaji FROM company.employees GROUP BY department"

data_company.execute(query9_company) #jalankan query

query9_company_result = data_company.fetchall() #ambil hasil execute query
query9_company_kolom = [query9_company_kolom[0] for query9_company_kolom in data_company.description] #ambil nama kolomnya

hasil9 = pd.DataFrame(query9_company_result, columns=query9_company_kolom) #ubah jadi df
hasil9

  department   ratarata_gaji
0         IT  8250000.000000
1   Keuangan  7500000.000000
2        SDM  6000000.000000
3  Pemasaran  7000000.000000